In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.5.3'

In [3]:
obj= pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [4]:
obj

d    4
b    7
a   -5
c    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj['a']

-5

In [8]:
obj[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [9]:
obj > 0

d     True
b     True
a    False
c     True
dtype: bool

In [10]:
obj[obj > 0]

d    4
b    7
c    3
dtype: int64

In [11]:
obj*2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
 'b' in obj

True

In [13]:
 'e' in obj

False

In [14]:
 sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [16]:
obj3 = pd.Series(sdata)

In [17]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [19]:
obj4 = pd.Series(sdata, index=states);obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
obj4.name = 'population'

In [24]:
obj4.index.name = 'state'

In [25]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [26]:
df=pd.DataFrame([[1,2,3],[4,5,6]]);df

   0  1  2
0  1  2  3
1  4  5  6

In [27]:
df=pd.DataFrame([[1,2,3],[4,5,6]],index=["a","b"],columns=list("klm"));df

   k  l  m
a  1  2  3
b  4  5  6

In [28]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
            'year': [2000, 2001, 2002, 2001, 2002, 2003],
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [29]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [30]:
frame = pd.DataFrame(data);frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [31]:
frame["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [32]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [33]:
frame['debt'] = 16.5 ; frame

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    Ohio  2001  1.7  16.5
2    Ohio  2002  3.6  16.5
3  Nevada  2001  2.4  16.5
4  Nevada  2002  2.9  16.5
5  Nevada  2003  3.2  16.5

In [34]:
import numpy as np

In [35]:
frame['debt'] = np.arange(10,16) ; frame

    state  year  pop  debt
0    Ohio  2000  1.5    10
1    Ohio  2001  1.7    11
2    Ohio  2002  3.6    12
3  Nevada  2001  2.4    13
4  Nevada  2002  2.9    14
5  Nevada  2003  3.2    15

In [36]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5]); val

2   -1.2
4   -1.5
5   -1.7
dtype: float64

In [37]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5    10
1    Ohio  2001  1.7    11
2    Ohio  2002  3.6    12
3  Nevada  2001  2.4    13
4  Nevada  2002  2.9    14
5  Nevada  2003  3.2    15

In [38]:
del frame["debt"];frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [39]:
frame["size"]=np.arange(100,700,100);frame

    state  year  pop  size
0    Ohio  2000  1.5   100
1    Ohio  2001  1.7   200
2    Ohio  2002  3.6   300
3  Nevada  2001  2.4   400
4  Nevada  2002  2.9   500
5  Nevada  2003  3.2   600

In [40]:
frame.columns

Index(['state', 'year', 'pop', 'size'], dtype='object')

In [41]:
frame.index

RangeIndex(start=0, stop=6, step=1)

In [42]:
frame.values

array([['Ohio', 2000, 1.5, 100],
       ['Ohio', 2001, 1.7, 200],
       ['Ohio', 2002, 3.6, 300],
       ['Nevada', 2001, 2.4, 400],
       ['Nevada', 2002, 2.9, 500],
       ['Nevada', 2003, 3.2, 600]], dtype=object)

In [43]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c']);obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [44]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e']);obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [45]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                             index=['a', 'c', 'd'],
                            columns=['Ohio', 'Texas', 'California'])

In [46]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [47]:
frame2 = frame.reindex(['a', 'b', 'c', 'd']); frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [48]:
states = ['Texas', 'Utah', 'California']

In [49]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [50]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e']);obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [51]:
 new_obj = obj.drop('c') ; new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [52]:
 data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                           index=['Ohio', 'Colorado', 'Utah', 'New York'],
                           columns=['one', 'two', 'three', 'four'])

In [53]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [54]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [55]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [56]:
 data.drop(['two', 'three'], axis='columns',inplace=True)

In [57]:
data

          one  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

In [58]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                           index=['Ohio', 'Colorado', 'Utah', 'New York'],
                           columns=['one', 'two', 'three', 'four'])

In [59]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [61]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [62]:
data['three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [63]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [64]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
 data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [66]:
 data.loc['Colorado']

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [67]:
 data.loc[['Colorado',"Utah"]]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [68]:
 data.loc[:,['two',"four"]]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [69]:
frame = pd.DataFrame(np.random.randint(0,10,(4, 3)), columns=list('bde'),
                         index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [70]:
frame

        b  d  e
Utah    6  4  3
Ohio    2  1  7
Texas   6  6  2
Oregon  6  4  2

In [71]:
f = lambda x: x.max() - x.min()

In [72]:
frame.apply(f)

b    4
d    5
e    5
dtype: int64

In [73]:
frame.apply(lambda x: x.max() - x.min())

b    4
d    5
e    5
dtype: int64

In [74]:
frame.apply(f,axis=1)

Utah      3
Ohio      6
Texas     4
Oregon    4
dtype: int64

In [75]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [76]:
frame.apply(f)

     b  d  e
min  2  1  2
max  6  6  7

In [77]:
myfunct=lambda x: x**2

In [80]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [81]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [82]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [83]:
obj = pd.Series(range(8), index=['d', 'a', 'b', 'c',4,2,3,1])

In [84]:
obj

d    0
a    1
b    2
c    3
4    4
2    5
3    6
1    7
dtype: int64

In [92]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                            index=['three', 'one'],
                         columns=['d', 'a', 'b', 'c'])

In [93]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [94]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [95]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [96]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [97]:
frame.sort_index(axis=1,inplace=True)

In [98]:
frame

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [99]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [100]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [101]:
frame.sort_values(by="a")

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [102]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [103]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [104]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [105]:
obj.index.is_unique

False

In [106]:
obj['a']

a    0
a    1
dtype: int64

In [107]:
obj['c']

4

In [108]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [109]:
df

          0         1         2
a -0.493680 -1.087610 -1.872846
a  1.235279  0.692580 -1.114682
b -0.735333 -1.232783  1.032429
b -2.023246  0.650322 -1.644847

In [110]:
df.loc['b']

          0         1         2
b -0.735333 -1.232783  1.032429
b -2.023246  0.650322 -1.644847

In [111]:
df = pd.DataFrame([[2.0, np.nan], [7, -4], [np.nan, np.nan], [1, -2]],
index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

In [112]:
df

   one  two
a  2.0  NaN
b  7.0 -4.0
c  NaN  NaN
d  1.0 -2.0

In [113]:
df.sum()

one    10.0
two    -6.0
dtype: float64

In [114]:
df.sum(axis=1)

a    2.0
b    3.0
c    0.0
d   -1.0
dtype: float64

In [115]:
 df.mean(axis='columns', skipna=False)

a    NaN
b    1.5
c    NaN
d   -0.5
dtype: float64

In [116]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.333333 -3.000000
std    3.214550  1.414214
min    1.000000 -4.000000
25%    1.500000 -3.500000
50%    2.000000 -3.000000
75%    4.500000 -2.500000
max    7.000000 -2.000000

In [117]:
df = pd.DataFrame({
  'FR': [4.0405, 4.0963, 4.3149],
   'GR': [1.7246, 1.7482, 1.8519],
    'IT': [804.74, 810.01, 860.13]},
   index=['1980-01-01', '1980-02-01', '1980-03-01'])

In [118]:
df

                FR      GR      IT
1980-01-01  4.0405  1.7246  804.74
1980-02-01  4.0963  1.7482  810.01
1980-03-01  4.3149  1.8519  860.13

In [119]:
df.pct_change()

                  FR        GR        IT
1980-01-01       NaN       NaN       NaN
1980-02-01  0.013810  0.013684  0.006549
1980-03-01  0.053365  0.059318  0.061876

In [120]:
df.pct_change(periods=2)

                  FR        GR       IT
1980-01-01       NaN       NaN      NaN
1980-02-01       NaN       NaN      NaN
1980-03-01  0.067912  0.073814  0.06883

In [121]:
np.random.seed(1)
df=pd.DataFrame(np.random.randint(5,10,(4,4)),index=list("abcd"),columns=list("xyzt"));df

   x  y  z  t
a  8  9  5  6
b  8  5  5  6
c  9  9  6  7
d  9  7  9  8

In [122]:
df.diff()

     x    y    z    t
a  NaN  NaN  NaN  NaN
b  0.0 -4.0  0.0  0.0
c  1.0  4.0  1.0  1.0
d  0.0 -2.0  3.0  1.0

In [123]:
df.diff(axis="columns")

    x  y  z  t
a NaN  1 -4  1
b NaN -3  0  1
c NaN  0 -3  1
d NaN -2  2 -1

In [124]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c']);obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [125]:
uniques = obj.unique()

In [126]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [127]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [128]:
mask = obj.isin(['b', 'c'])

In [129]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [130]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object